<template>
  <q-page>
    <div class="row">
      <q-card flat class="q-mt-md col-12 col-md-4 offset-md-4">
        <q-card-section>
          <div class="row justify-between items-center">
            <div class="text-h6 text-weight-bold">
              {{ t('rulesPage.title') }}
            </div>
            <q-btn
              outline
              icon="chevron_left"
              no-caps
              :label="isDesktop ? t('shared.toSearchBtn') : ''"
              :round="!isDesktop"
              color="secondary"
              @click="() => router.push('/')"
            />
          </div>
        </q-card-section>
        <q-card-section>
          <p>
            <strong>Чёрный список владельцев животных</strong> – это упреждающий
            способ уберечь животных от недобросовестного или жестокого
            обращения.
          </p>
          <p>
            <strong>Цель сервиса</strong> – проинформировать хозяев и кураторов,
            ищущих временную передержку или новых постоянных хозяев о
            недобросовестных лицах, а также лицах, проявляющих живодерские
            действия в отношении животных.
          </p>
          <h6>Правила сервиса</h6>
          <ol class="q-gutter-md">
            <li>
              Настоящий сервис преследует исключительно гуманные цели. В роли
              модератора выступает любой пользователь данного сервиса и потому
              исключительно на него возлагается юридическая и моральная
              ответственность за распространение заведомо ложных сведений о
              лицах и преднамеренную порчу их репутации в соответсвии со статьей
              №128 УК РФ о клевете и распространении заведомо ложных сведений.
            </li>
            <li>
              Любой пользователь, обнаруживший недостоверные или оскорбительные
              данные о себе в праве направить обращение в администрацию сервиса:
              <a href="/#/contacts" class="text-grey-10"
                >через специальную форму</a
              >. Администрация в свою очередь обязуется рассмотреть жалобу в
              течение десяти рабочих дней с момента её поступления и сообщить о
              решении в ответном письме.
            </li>
            <li>
              Пользователь в праве добавить данные о недобросовестном владельце
              в настоящий сервис с обязательным указанием достоверной причины
              добавления, если этот владелец в настоящий момент отсутствует в
              базе данных сервиса.
            </li>
            <li>
              Пользователь, обнаруживший в настоящем сервисе информацию о
              недобросовестном владельце вправе дополнить её посредством
              добавления комментария, если, по его мнению, текущие данные
              являются неполными или недостоверными.
            </li>
            <li>
              Администрация оставляет за собой право изменять и дополнять
              вышеописанные правила сервиса.
            </li>
          </ol>
        </q-card-section>
      </q-card>
    </div>
  </q-page>
</template>

<script lang="ts" setup>
import { useRouter } from 'vue-router';
import { useI18n } from 'vue-i18n';

const router = useRouter();
const { t } = useI18n();

defineProps<{ isDesktop: boolean }>();
</script>

<style lang="scss"></style>
